In [1]:
import pandas as pd 
import matplotlib as plt
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [2]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})



df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],'hire_date': [2004, 2008, 2012, 2014]})



df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],'supervisor': ['Carly', 'Guido', 'Steve']})


df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})



df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'salary': [70000, 80000, 120000, 90000]})


df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],'food': ['fish', 'beans', 'bread']},columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])



df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'rank': [1, 2, 3, 4]})


df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'rank': [3, 1, 4, 2]})

In [3]:
import numpy as np 
a=[1,2,3]
b=[4,5,6]
np.concatenate([a,b])

array([1, 2, 3, 4, 5, 6])

In [4]:
d1=make_df('AB',[1,2])
d2=make_df('AB',[3,4])
#pd.concat([df1,df2])
display('d1','d2','pd.concat([d1,d2])')

d1
    A   B
1  A1  B1
2  A2  B2

d2
    A   B
3  A3  B3
4  A4  B4

pd.concat([d1,d2])
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [5]:
pd.concat([d1,d2],axis=1)

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [6]:
d3=make_df('AB',[0,1])
d4=make_df('CD',[0,1])
display('d3','d4','pd.concat([d3,d4],axis=1)')

d3
    A   B
0  A0  B0
1  A1  B1

d4
    C   D
0  C0  D0
1  C1  D1

pd.concat([d3,d4],axis=1)
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [7]:
x=make_df('AB',[1,2])
y=make_df('AB',[1,2])
display('x','y','pd.concat([x,y],ignore_index=True)')

x
    A   B
1  A1  B1
2  A2  B2

y
    A   B
1  A1  B1
2  A2  B2

pd.concat([x,y],ignore_index=True)
    A   B
0  A1  B1
1  A2  B2
2  A1  B1
3  A2  B2

In [8]:
w=make_df('ABC',[1,2])
z=make_df('BCD',[1,2])
display('w','z','pd.concat([w,z])')

w
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

z
    B   C   D
1  B1  C1  D1
2  B2  C2  D2

pd.concat([w,z])
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
1  NaN  B1  C1   D1
2  NaN  B2  C2   D2

In [9]:
display('w','z','pd.concat([w,z],join="inner")')

w
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

z
    B   C   D
1  B1  C1  D1
2  B2  C2  D2

pd.concat([w,z],join="inner")
    B   C
1  B1  C1
2  B2  C2
1  B1  C1
2  B2  C2

In [10]:
display('w','z','pd.concat([w,z],axis=1)')

w
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

z
    B   C   D
1  B1  C1  D1
2  B2  C2  D2

pd.concat([w,z],axis=1)
    A   B   C   B   C   D
1  A1  B1  C1  B1  C1  D1
2  A2  B2  C2  B2  C2  D2

In [11]:

display('w','z','pd.concat([w,z],join="inner",axis=1)')

w
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

z
    B   C   D
1  B1  C1  D1
2  B2  C2  D2

pd.concat([w,z],join="inner",axis=1)
    A   B   C   B   C   D
1  A1  B1  C1  B1  C1  D1
2  A2  B2  C2  B2  C2  D2

In [12]:
ghi=pd.merge(df1,df2).sort_values('hire_date',ascending=False).reset_index(drop=True)
ghi

  employee        group  hire_date
0      Sue           HR       2014
1     Jake  Engineering       2012
2      Bob   Accounting       2008
3     Lisa  Engineering       2004

In [13]:
gh=pd.merge(ghi,df4)#many to one mapping
display('ghi','df4','gh')

ghi
  employee        group  hire_date
0      Sue           HR       2014
1     Jake  Engineering       2012
2      Bob   Accounting       2008
3     Lisa  Engineering       2004

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

gh
  employee        group  hire_date supervisor
0      Sue           HR       2014      Steve
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Bob   Accounting       2008      Carly

In [14]:
g=pd.merge(df1,df5)#many to many
display('df1','df5','g')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

g
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [15]:
display('df1','df2','pd.merge(df1,df2,on="employee")')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

pd.merge(df1,df2,on="employee")
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [16]:
display('df1','df3','pd.merge(df1,df3,left_on="employee",right_on="name")')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1,df3,left_on="employee",right_on="name")
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [17]:
pd.merge(df1,df3,left_on="employee",right_on="name").drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [18]:
a1=df1.set_index('employee')
a2=df2.set_index('employee')
display('a1','a2','pd.merge(a1,a2,left_index=True,right_index=True)')

a1
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

a2
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(a1,a2,left_index=True,right_index=True)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [19]:
display('df6','df7','pd.merge(df6,df7)')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6,df7)
   name   food drink
0  Mary  bread  wine

In [22]:
pd.merge(df6,df7,how='inner')

   name   food drink
0  Mary  bread  wine

In [23]:
pd.merge(df6,df7,how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [24]:
pd.merge(df6,df7,how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [25]:
pd.merge(df6,df7,how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [28]:
display('df8','df9','pd.merge(df8,df9,on="name")')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8,df9,on="name")
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [29]:
display('df8','df9','pd.merge(df8,df9,on="rank")')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8,df9,on="rank")
  name_x  rank name_y
0    Bob     1   Jake
1   Jake     2    Sue
2   Lisa     3    Bob
3    Sue     4   Lisa

In [30]:
display('df8','df9','pd.merge(df8,df9,on="name",suffixes=["_L","_R"])')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8,df9,on="name",suffixes=["_L","_R"])
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [32]:
e1.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [34]:
e2=pd.read_csv('https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv')
e2.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [36]:
e3=pd.read_csv('https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv')
e3.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [37]:
pd.merge(e1,e2)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False